[{ "name" : "Rohan Ramchand", "username" : "rohan", "roles" : [ "Director" ], "yr" : 17, "description" : "Rohan Ramchand grew up on the streetz (with a \"z\") of Houston, specifically Bellaire Boulevard, Kirby Drive, and Westheimer Lane. After serving as choir president and student director as a senior, never once having his privilege checked, he went on to UT and sought out ways by which he would never have to check his privilege again. He now serves as director and webmaster for the Songhorns.", "major" : "Computer Science + Mathematics", "order" : 0, "alum" : false },
{ "name" : "David Fong", "roles" : [ "Assistant Director" ], "username" : "david", "yr" : 18, "order" : 1, "description" : "David Fong is a BME sophomore from San Antonio, Texas interested in neuroscience and brain-computer interfaces. He joined Songhorns to bring the musical skills he's been cultivating from the shower to the stage! Current Songhorns assistant director and arranger, David enjoys composing music and taking long, thoughtful walks in his free time. His favorite food is the \"barbecued crabs\" from Sartin's Seafood in Nederland, Texas. (Seriously go try them, they're heavenly.)", "alum" : false, "major" : "Biomedical Engineering" },
{ "name" : "Ori Ravid", "username" : "ori", "roles" : [ ], "yr" : 16, "major" : "Business", "order" : 5, "alum" : false, "description" : "Hailing from Boston, Ori Ravid boasts a veritable plethora of singing experience prior to joining the Texas Songhorns in the fall of 2012. From performing at Carnegie Hall to Hogg Auditorium, Ori's angelic voice has brought overwhelming feelings of exaltation to the masses. You're welcome, masses." },
{ "name" : "Chris Collier", "roles" : [ "President" ], "username" : "chris", "yr" : 17, "order" : 2, "alum" : false, "description" : "Legend has it that Chris Collier put on this Kindergarden resume that he wanted to be president of the Songhorns, a group that wouldn't even be created until over a decade later. He hopes to use the skills he has acquired in Songhorns to help soften the emotional impact of when his post-graduation musical career inevitably fails. He would like to thank the movie Pitch Perfect for making a capella cool (so he thinks).", "major" : "Computer Science" },
{ "name" : "Ammar Mahesri", "roles" : [ "Vice President" ], "username" : "ammar", "yr" : 18, "order" : 3, "alum" : false, "major" : "Business", "description" : "Ammar likes making noises with his mouth, which is the foremost reason why he joined an a cappella group. He is the current Vice President of the Songhorns and a first year Business major. But when he’s not busy saving the corporate world from disaster, Ammar enjoys sleeping for extensive periods of time, traveling overseas, and eating copious amounts of food (one time he ate, like, four tacos)." },
{ "name" : "Dylan Gonzales", "username" : "dylan", "description" : "Dylan John Gonzales is a 21 year old singer/fratboy whose musical talent and sultry blue eyes can warm even the coldest of hearts. In his free time he woos Instagram users with 10 second teasers of his beautiful voice and enjoys Thursday evenings of \"family fun\" on 6th street. He spent much of his youth as a local fiddler and ultimate girl crush in his high school choir, and today he divides his time equally between his adorable dog, Remington Scott, and everything else.", "order" : 6, "alum" : false, "major" : "Sociology", "yr" : 18 },
{ "name": "Alex dy Cruz", "username": "alex", "description": "unknown", "order": 7, "alum": false, "major": "Petroleum Engineering", "yr": 18},
{ "name": "Pranav Nair", "username": "pranav", "description": "unknown", "order": 8, "alum": false, "major": "unknown", "yr": 19},
{ "name": "Remy Kent", "username": "remy", "description": "unknown", "order": 9, "alum": false, "major": "unknown", "yr": 19},
{ "name": "Jon Pattie", "username": "jon", "description": "unknown", "order": 10, "alum": false, "major": "unknown", "yr": 16},
{ "name": "Jonathon McClanahan", "username": "talljon", "description": "unknown", "order": 11, "alum": false, "major": "Business Honors", "yr": 19},
{ "name": "Cameron Rose", "username": "cam", "description": "unknown", "order": 12, "alum": false, "major": "Aerospace Engineering", "yr": 18},
{ "name": "Jitesh Mullapudi", "username": "jitesh", "description": "unknown", "order": 13, "alum": false, "major": "Business Honors", "yr": 19}
]